<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"6b8eb211bcc11e130f4546d0d939bedeecd875a85fd0df5012de82d0dd3913ff","plan_job_ref":"Job Create Terraform plan (DEV) #70 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14992614692","plan_out_hash":"1b99a6a6747acdb992778d953afcbbcdfaa89aecd29f77f44da6643ba6fa3026","plan_hash":"15628c811d401066a5a5a0943c840ef1339e90d8e81b492fa4d0c4c4ac8ec305","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                loki:
                  podLabels:
                    "azure.workload.identity/use": "true" # Add this label to the Loki pods to enable workload identity
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: azure
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  storage_config:
                    azure:
                      account_name: "openmrscoredevsa02"
                      container_name: "chunks" # Your actual Azure Blob Storage container name (loki-azure-dev-chunks)
                      use_federated_token: true # Use federated token for authentication
                  ingester:
                    chunk_encoding: snappy
                  pattern_ingester:
                    enabled: true
                  limits_config:
                    allow_structured_metadata: true
                    volume_enabled: true
                    retention_period: 672h # 28 days retention
                  compactor:
                    retention_enabled: true
                    delete_request_store: azure
                  ruler:
                    enable_api: true
                    storage:
                      type: azure
                      azure:
                        account_name: "openmrscoredevsa02"
                        container_name: "ruler" # Your actual Azure Blob Storage container name (loki-azure-dev-ruler)
                        use_federated_token: true # Use federated token for authentication
                      alertmanager_url: http://prom:9093 # The URL of the Alertmanager to send alerts (Prometheus, Mimir, etc.)
                
                  querier:
                    max_concurrent: 4
                
                  storage:
                    type: azure
                    bucketNames:
                      chunks: "chunks" # Your actual Azure Blob Storage container name (loki-azure-dev-chunks)
                      ruler: "ruler" # Your actual Azure Blob Storage container name (loki-azure-dev-ruler)
                      # admin: "admin-loki-devrel" # Your actual Azure Blob Storage container name (loki-azure-dev-admin)
                    azure:
                      accountName: "openmrscoredevsa02"
                      useFederatedToken: true # Use federated token for authentication
                
                # Define the service account
                serviceAccount:
                  create: false
                
                deploymentMode: Distributed
                
                ingester:
                  replicas: 3
                  zoneAwareReplication:
                    enabled: false
                
                querier:
                  replicas: 3
                  maxUnavailable: 2
                
                queryFrontend:
                  replicas: 2
                  maxUnavailable: 1
                
                queryScheduler:
                  replicas: 2
                
                distributor:
                  replicas: 3
                  maxUnavailable: 2
                compactor:
                  replicas: 1
                
                indexGateway:
                  replicas: 2
                  maxUnavailable: 1
                
                ruler:
                  replicas: 1
                  maxUnavailable: 1
                
                # This exposes the Loki gateway so it can be written to and queried externaly
                gateway:
                  service:
                    type: LoadBalancer
                  basicAuth:
                    enabled: true
                    existingSecret: loki-basic-auth
                
                # Since we are using basic auth, we need to pass the username and password to the canary
                lokiCanary:
                  extraArgs:
                    - -pass=$(LOKI_PASS)
                    - -user=$(LOKI_USER)
                  extraEnv:
                    - name: LOKI_PASS
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: password
                    - name: LOKI_USER
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: username
                
                # Enable minio for storage
                minio:
                  enabled: false
                
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                singleBinary:
                  replicas: 0
            EOT,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubectl_manifest.namespace_loki will be created
+   resource "kubectl_manifest" "namespace_loki" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Namespace"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "loki"
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: loki
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.sa_loki will be created
+   resource "kubectl_manifest" "sa_loki" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ServiceAccount"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "loki"
+       namespace               = "loki"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              annotations:
                azure.workload.identity/client-id: d6de217f-32de-4118-b479-9c958a3e40c4
              labels:
                azure.workload.identity/use: "true"
              name: loki
              namespace: loki
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #70](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14992614692)